Revit 2027 API
NumberingSchema.GetNumberingSequencesInfos Method
 Returns all numbering sequences infos within this numbering schema.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<NumberingSequenceInfo> GetNumberingSequencesInfos()
Public Function GetNumberingSequencesInfos As IList(Of NumberingSequenceInfo)
public:
IList<NumberingSequenceInfo^>^ GetNumberingSequencesInfos()
member GetNumberingSequencesInfos : unit -> IList<NumberingSequenceInfo>
Return Value
IList<NumberingSequenceInfo>
 Collection of sequence infos
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace